{
  "key_channel_insights": [
    {
      "line_title": "OTA Key Insight",
      "line_content": "OTA-lower remains the largest share at 41% last week, though it dipped 6% from the prior period, while OTA-higher rose by 8%."
    },
    {
      "line_title": "MSE Key Insight",
      "line_content": "MSE-lower dominates at around 88% of itineraries, slightly down from the previous week’s 91%."
    },
    {
      "line_title": "GDS Key Insight",
      "line_content": "GDS-lower leads at 86% overall, while GDS-higher remains below 1% but doubled from last week."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "OTA Lower Dominance",
      "line_content": "OTA Lower leads with about 41% of itineraries last week, though it dipped 6% from the prior week."
    },
    {
      "line_title": "Rising OTA Higher",
      "line_content": "OTA Higher climbed by around 8% week-over-week, indicating a notable shift toward higher channel pricing."
    },
    {
      "line_title": "Minimal Non-Availability",
      "line_content": "OTA Not Found remains low, at around 3–5% for most markets, reflecting consistent availability."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Accounts for roughly 3–4% of itineraries in most segments, showing only minor week-to-week fluctuation."
    },
    {
      "line_title": "Same",
      "line_content": "Represents about 22% of total itineraries last week, with a modest 3% dip from the previous week."
    },
    {
      "line_title": "OTA Lower",
      "line_content": "Remains the largest category at 41% last week, despite a 6% decline from the previous week but still 5% above last month."
    },
    {
      "line_title": "OTA Higher",
      "line_content": "Stands at about 33% last week, up 8% week-over-week, indicating a greater incidence of fares above the airline site."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "OTA Lower leads at 42%, though OTA Higher jumped nearly 9% from last week, showing heightened short-haul fare competition."
    },
    {
      "line_title": "Long Haul",
      "line_content": "OTA Lower holds 37%, while OTA N/A rose slightly to around 12%, suggesting fewer matched fares or missing site offers on long flights."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "AR Origins",
      "line_content": "OTA Lower prevails at 46%, but OTA Higher jumped 9% from the prior week, indicating shifting demand or pricing strategies."
    },
    {
      "line_title": "Non-AR Origins",
      "line_content": "All itineraries remained identical to website prices last week, with minimal historical movement."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "OTA Lower leads at 39%, yet OTA Higher increased 8% from last week, narrowing the gap between higher and lower fares."
    },
    {
      "line_title": "Far Out",
      "line_content": "OTA Lower is at 44% despite a 10% drop from last week, while OTA Higher advanced by nearly 9%, signaling a shift in advance purchase pricing."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "High MSE Undercut",
      "line_content": "MSE listings are below website prices in about 88% of cases, showing a slight downward drift from the previous week’s 91% share."
    },
    {
      "line_title": "Minimal Not Found",
      "line_content": "Unlisted fares remain modest at around 4% overall but rise to 11% on long-haul routes."
    },
    {
      "line_title": "Stable Price Changes",
      "line_content": "Price similarities and higher MSE fares each stay below 6% of total observations, with minor week-to-week fluctuations."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE N/A",
      "line_content": "A small 4% of fares are unavailable in this channel, growing modestly from last week’s 3%."
    },
    {
      "line_title": "SAME",
      "line_content": "Pricing matches hover around 6%, largely stable against last week and previous month."
    },
    {
      "line_title": "MSE LOWER",
      "line_content": "Dominant at 88%, with a slight decrease from 91% in the prior week."
    },
    {
      "line_title": "MSE HIGHER",
      "line_content": "Remains minimal at under 2%, showing limited impact on overall revenue risk."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Nearly 89% of fares are lower on MSE, with only 2% not listed. Matches stand at about 7%."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Fares are lower on MSE 85% of the time; 11% are unavailable, signaling a potential coverage gap."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "AR Origins",
      "line_content": "MSE consistently undercuts website fares at 91% frequency, with only 4% unlisted."
    },
    {
      "line_title": "Non-AR Origins",
      "line_content": "Rates are split between 69% MSE-lower and 31% price parity, with no higher fares observed."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "MSE is cheaper in 88% of itineraries, with 3% higher prices. Unavailability remains below 3%."
    },
    {
      "line_title": "Far Out",
      "line_content": "Close to 89% lower fares, and only 0.2% cost more than the website, indicating strong long-lead discounts."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Strong GDS-Lower Pattern",
      "line_content": "Fares are lower in GDS for roughly 86% of itineraries, showing minimal change from previous periods."
    },
    {
      "line_title": "GDS-Higher Uptick",
      "line_content": "Although still below 1%, GDS-higher fares jumped from 0.31% to 0.62% week over week."
    },
    {
      "line_title": "GDS N/A Growth",
      "line_content": "Website-only fares rose 40% from last week but remain under 3% of total records."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "Website Offer Not Found",
      "line_content": "Now at nearly 2.9% of itineraries, up 40% from the previous week."
    },
    {
      "line_title": "Same Fares",
      "line_content": "Stable near 10% of observed cases without significant week-to-week shifts."
    },
    {
      "line_title": "GDS Lower",
      "line_content": "Dominates at around 86% of itineraries, with only a slight dip from last week."
    },
    {
      "line_title": "GDS Higher",
      "line_content": "Represents about 0.6% overall, more than doubling from 0.3% previously."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Around 90% are GDS-lower; GDS-higher nearly doubled but remains under 1%."
    },
    {
      "line_title": "Long Haul",
      "line_content": "GDS-lower sits at 69%; GDS-higher dropped by half, while N/A climbed from 9.5% to 11.3%."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "AR Origins",
      "line_content": "GDS-lower reaches 96%, with almost no fares matching or exceeding the website."
    },
    {
      "line_title": "Non-AR Origins",
      "line_content": "SAME fares dominate at 98%, leaving minimal room for GDS-lower or higher."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "GDS-lower stands at about 87%, with GDS-higher still under 1%."
    },
    {
      "line_title": "Far Out",
      "line_content": "GDS-lower is near 85%, while GDS-higher climbed from 0.23% to 0.66% in the last week."
    }
  ]
}