{
  "key_channel_insights": [
    {
      "line_title": "OTA Insight",
      "line_content": "Nearly 94% matching fares, with minor underpricing and overpricing at around 1–3%."
    },
    {
      "line_title": "MSE Insight",
      "line_content": "Over 95% of fares remain cheaper, confirming a consistently competitive position."
    },
    {
      "line_title": "GDS Insight",
      "line_content": "Around 90% parity with direct site, though non-US routes see nearly 30% higher fares."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Stable Matching",
      "line_content": "Across the OTA channel, fares matched the airline’s site in nearly 94% of cases this past week, showing a steady rate overall."
    },
    {
      "line_title": "Limited Absences",
      "line_content": "Website fares were not listed on the OTA about 3% of the time, registering mild week-over-week increases but remaining an outlier overall."
    },
    {
      "line_title": "Small Gaps Lower or Higher",
      "line_content": "OTA undercuts and overpricing each occurred in only 1–3% of cases; both segments fluctuated slightly, driven mostly by small sample swings."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "Not Found (OTA N/A)",
      "line_content": "A moderate 3% of fares were missing from the OTA listings; frequency rose marginally by 0.6% from last week."
    },
    {
      "line_title": "Same Pricing",
      "line_content": "Consistently high overlap, with over 93% parity this week, dipping just 2% from the previous week."
    },
    {
      "line_title": "OTA Lower",
      "line_content": "A minor share at around 2%, though recent weekly changes suggest volatility in these underpriced listings."
    },
    {
      "line_title": "OTA Higher",
      "line_content": "At roughly 1% of cases, slightly down from last week, reflecting limited upside deviations on the OTA."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "About 93% alignment with the airline’s site; minimal OTA overpricing and a 2% rate of OTA undercutting."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Stable at 98% same pricing and 2% not found on the channel, with no notable instances of higher or lower fares."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "US",
      "line_content": "Over 94% of US flights priced the same, <1% of listings exceeded the airline price, and ~2% were under."
    },
    {
      "line_title": "Non-US",
      "line_content": "Around 28% were higher on the OTA, with same pricing at about 69% and undercuts near 1%."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Strong parity above 94%, with 4% not displayed on the OTA and minimal overpricing or underpricing."
    },
    {
      "line_title": "Far Out",
      "line_content": "Same pricing leads at ~92–96%; undercuts dropped from ~5.6% to below 1% week-to-week, indicating a cutback in early OTA discounts."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "MSE Predominantly Lower",
      "line_content": "Over 95% of recent checks on MSE were cheaper than direct site fares. Minor weekly fluctuations stayed under 1%."
    },
    {
      "line_title": "Minimal MSE Higher Share",
      "line_content": "Fares priced higher on MSE consistently remained below 1%, indicating limited exposure to overpriced inventory."
    },
    {
      "line_title": "US vs. Non-US Gap",
      "line_content": "US routes hit 96% lower fares on MSE last week, while Non-US hovered closer to 69%, showing a noticeable discrepancy."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE Not Found",
      "line_content": "About 2% of fares were missing on MSE with no significant week-to-week movement."
    },
    {
      "line_title": "Same",
      "line_content": "Matching fares stayed around the 2% mark, reflecting stable alignment with the direct site."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "Over 95% of itineraries remained cheaper on MSE, underscoring a consistently competitive position."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "Less than 1% of fares exceeded the airline site, indicating minimal risk of costlier offerings."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Over 95% of short-haul fares were lower on MSE last week, a slight 0.32% dip from the prior week but still dominant."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Around 93% of long-haul fares were cheaper on MSE, up nearly 3% from the previous week, reflecting strengthened pricing leverage."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "US",
      "line_content": "US point-of-origin retained a 96% MSE-lower rate, with weekly changes under 0.2%."
    },
    {
      "line_title": "Non-US",
      "line_content": "Non-US routes dropped nearly 4% in MSE-lower coverage to 69%, highlighting weaker consistency in non-US markets."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Close-in itineraries saw a 95.68% MSE-lower share, maintaining stable fare advantages week over week."
    },
    {
      "line_title": "Far Out",
      "line_content": "Far-out bookings had a 95.60% lower rate on MSE, slightly below close-in but still reflecting robust fare savings."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Parity Dominates",
      "line_content": "Around 90% of GDS fares match the website, showing stable overall parity."
    },
    {
      "line_title": "Non-US Premiums",
      "line_content": "In non-US routes, GDS fares are higher in about 30% of cases, significantly above the global average."
    },
    {
      "line_title": "Lower Share Eases",
      "line_content": "GDS-lower fares remain below 3% in most segments, with a slight downward shift week over week."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A",
      "line_content": "Roughly 7% of fares are unavailable in GDS, with small weekly fluctuations."
    },
    {
      "line_title": "SAME",
      "line_content": "Consistently at or near 90% across periods, reflecting strong price alignment."
    },
    {
      "line_title": "GDS HIGHER",
      "line_content": "Under 2% overall, but jumps to over 30% in certain non-US markets."
    },
    {
      "line_title": "GDS LOWER",
      "line_content": "Below 3% overall, yet trending downward across most weekly and monthly views."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Nearly 89% match the website, with GDS-lower dropping from 2.68% to 0.55% week to week."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Over 95% of fares align with the website, indicating minimal GDS price deviations."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "US",
      "line_content": "Over 90% of fares show parity, with GDS-lower near 2.7% and GDS-higher well under 1%."
    },
    {
      "line_title": "Non-US",
      "line_content": "Only about 60% are at parity, while 30% show GDS premiums, indicating a notable gap."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Around 90% are aligned, with 8% not found on GDS and GDS-lower below 2%."
    },
    {
      "line_title": "Far Out",
      "line_content": "About 87% match the site, yet GDS-lower reaches 5.56%, double that of close-in bookings."
    }
  ]
}