{
  "key_channel_insights": [
    {
      "line_title": "OTA Insight",
      "line_content": "OTA fares run significantly higher than the airline's site for both short and long-haul routes, with about half the itineraries missing."
    },
    {
      "line_title": "MSE Insight",
      "line_content": "MSE shows a growing percentage of cheaper fares, with steady alignment to website pricing and minimal overpricing risk."
    },
    {
      "line_title": "GDS Insight",
      "line_content": "Over half of fares remain unavailable on GDS, and nearly half of those found are higher, averaging a modest premium but consistently above the website."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "High OTA Pricing",
      "line_content": "Channel fares surpass the airline site in many cases, with short-haul differences reaching 47% and nearly full coverage of higher fares in non-FI markets."
    },
    {
      "line_title": "Frequent Coverage Gaps",
      "line_content": "Over half of all itineraries show no matching offer (OTA N/A), especially for FI and far-out bookings, pointing to incomplete listing or unaligned inventory."
    },
    {
      "line_title": "Long Haul Less Marked Up",
      "line_content": "For long-haul routes, although OTA fares are often higher, the price gap is modest at 17–18% above the airline site."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Appears about half the time overall, with small but steady increases from prior periods."
    },
    {
      "line_title": "SAME",
      "line_content": "No observed instances of identical pricing versus the airline’s website."
    },
    {
      "line_title": "OTA LOWER",
      "line_content": "No recorded cases of channel fares undercutting the airline site."
    },
    {
      "line_title": "OTA HIGHER",
      "line_content": "Frequently observed, especially for non-FI points of origin, with markups ranging from 17% on long haul to nearly 47% on short haul."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "OTA N/A hovers around 54%, and OTA HIGHER tracks at 46–47% price difference, reflecting significant fare marks above the airline site."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Nearly all (90–100%) itineraries are priced higher on the OTA, but the gap remains lower at roughly 17–18%."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "FI Markets",
      "line_content": "OTA N/A is common at 66–68%, while the rest typically shows OTA fares up 45–47% vs. the airline."
    },
    {
      "line_title": "Non-FI Markets",
      "line_content": "Close to 98–99% fall under OTA HIGHER, indicating a substantial premium, roughly 42% over the airline’s website."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Just under half of itineraries have no OTA listing, while others are higher by around 38–39%."
    },
    {
      "line_title": "Far Out",
      "line_content": "OTA N/A stands at ~57% and is rising, but where listed, fares outpace the airline by 53–54%."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Growing MSE Cost Advantage",
      "line_content": "Over 40% of itineraries were cheaper on MSE last week, up from roughly 33%, demonstrating a notable shift."
    },
    {
      "line_title": "Stable Matching Rates",
      "line_content": "Pricing matched the website on more than half of fares, though this share fell slightly from 64% to 55%."
    },
    {
      "line_title": "Minimal Elevated Prices",
      "line_content": "Only 2–3% of fares were higher on MSE, signaling low overpricing risk."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE Not Found",
      "line_content": "Under 1% of website fares were missing on MSE, up subtly from 0.37% to 0.55% week over week."
    },
    {
      "line_title": "Same",
      "line_content": "Around 55–64% of fares matched the website price, reflecting consistent alignment despite a recent dip."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "Now at 43% of fares, marking a jump of nearly 10 points from the prior period."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "Remains at a low 2–3%, showing limited instances of channel overpricing."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Mirrors the overall trend: around two-thirds match the website and over 30% are cheaper on MSE; recent data shows a notable rise in MSE-lower fares."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Limited data (2 ODs) but indicates most fares (65%+) remain cheaper on MSE with a smaller portion matching."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "FI",
      "line_content": "Nearly 80% of fares match the website, leaving little room for MSE-lower incidences."
    },
    {
      "line_title": "Non-FI",
      "line_content": "Around 80% of fares are below the website price, highlighting strong MSE competitiveness in these markets."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Approximately 60% match and over 35% are cheaper on MSE, with cheaper fares edging upward in recent data."
    },
    {
      "line_title": "Far Out",
      "line_content": "Around 70% match initially, though cheaper MSE fares jumped from 29% to 43% week over week."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Over Half Unavailable",
      "line_content": "More than 50% of website fares remain unavailable on GDS, with N/A reaching 52% last week."
    },
    {
      "line_title": "Consistent Premium",
      "line_content": "Across all ODs, when fares do appear, 47% are higher on GDS, averaging a 0.45% premium."
    },
    {
      "line_title": "Long-Haul Markup",
      "line_content": "Long-haul routes are entirely higher on GDS (100% last week), indicating a systematic fare premium."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A",
      "line_content": "Up slightly by 1.78% vs. previous week, signaling an increase in fares missing from GDS."
    },
    {
      "line_title": "Same",
      "line_content": "Negligible overlap, at or near 0% across all timeframes."
    },
    {
      "line_title": "GDS Higher",
      "line_content": "Accounts for nearly half of the found fares, with a small drop of 1.96% vs. previous week."
    },
    {
      "line_title": "GDS Lower",
      "line_content": "Remains minimal at about 0.4% of fares, unchanged over the month."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Over half are not listed on GDS, while 45% found are priced higher, reflecting a consistent trend."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Fares on GDS are almost universally higher, near 100% for last and previous weeks."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "FI Origins",
      "line_content": "68% of fares are missing on GDS; among those found, 32% are higher than the website."
    },
    {
      "line_title": "Non-FI Origins",
      "line_content": "Only 1.56% missing, but nearly all displayed fares (97.66%) carry a GDS premium."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Roughly half missing from GDS and just over half of the found fares are higher, tapering off slightly from last week."
    },
    {
      "line_title": "Far Out",
      "line_content": "56% of fares are unavailable, with 43% higher on GDS. Higher fares dipped 3.37% vs. previous week."
    }
  ]
}