{
  "key_channel_insights": [
    {
      "line_title": "OTA Key Insight",
      "line_content": "OTAs remain higher than direct fares in over 98% of itineraries, with markups up to 36%."
    },
    {
      "line_title": "MSE Key Insight",
      "line_content": "MSE fares match airline rates ~61% of the time and run cheaper on ~32% of itineraries, indicating a strong competitive edge."
    },
    {
      "line_title": "GDS Key Insight",
      "line_content": "GDS fares are higher about 80% of the time, with ~20% markups and limited parity."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "High Frequency Markups",
      "line_content": "OTA fares exceed direct site fares more than 98% of the time, with markups ranging from about 10% to 36%."
    },
    {
      "line_title": "Rare Lower Prices",
      "line_content": "Less than 1% of itineraries are cheaper on OTA, though they can be discounted as much as 23% in select markets."
    },
    {
      "line_title": "Stable Patterns",
      "line_content": "Week-on-week shifts are modest across all statuses, showing a broadly consistent pricing relationship."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Rarely above 2% of cases, with slight bumps in short-haul and far-out markets from last week."
    },
    {
      "line_title": "SAME",
      "line_content": "Stays under 1% of itineraries overall, with negligible movement or price difference changes."
    },
    {
      "line_title": "OTA HIGHER",
      "line_content": "Persistent in 98–99% of instances; markups run from about 10% on some long-haul routes to 36% far out."
    },
    {
      "line_title": "OTA LOWER",
      "line_content": "Under 1% frequency, but can offer 3–23% savings compared to the airline site."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "99% of prices are higher, averaging a 31% markup, while <1% of cheaper cases show about an 8% discount."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Around 95% of fares run higher at roughly 10% above website levels, with cheaper options saving about 3%."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "BR",
      "line_content": "OTA fares price higher 99.7% of the time with a 23% premium; cheaper at 0.04% frequency for a 23% discount."
    },
    {
      "line_title": "Non-BR",
      "line_content": "98% of fares are higher with a 33% markup, and 0.31% cheaper itineraries see around 4% savings."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "OTA Higher stands at 98.4% with a 26% uplift, while 0.28% cheaper flights offer around 5% savings."
    },
    {
      "line_title": "Far Out",
      "line_content": "High fares rule at 99.37% and a 36% premium; only 0.09% of itineraries are cheaper by about 3%."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Stable SAME",
      "line_content": "Over 61% of fares match the website, with only a slight dip from the prior week."
    },
    {
      "line_title": "Significant MSE Lower",
      "line_content": "Roughly 32% of itineraries are cheaper on MSE, offering a competitive advantage."
    },
    {
      "line_title": "Minimal N/A",
      "line_content": "'Website not found' cases remain well below 1%, indicating strong channel coverage."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "N/A Remains Tiny",
      "line_content": "Only around 0.2% of fares had no MSE match, showing negligible change week to week."
    },
    {
      "line_title": "Largest Same Share",
      "line_content": "61–62% of fares match airline pricing, although trending slightly downward from past data."
    },
    {
      "line_title": "Lower Share at One-Third",
      "line_content": "Nearly 32% of fares are lower on MSE, stable from last week and up over 2% month to month."
    },
    {
      "line_title": "Higher Share Still Small",
      "line_content": "Less than 6% of fares appear higher on MSE, but it has inched up modestly since last week."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "61% of fares match, with around 33% lower on MSE and just 5.7% higher than the website."
    },
    {
      "line_title": "Long Haul",
      "line_content": "64% of fares match, 28% offer better deals on MSE, and about 7.5% are higher than airline prices."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "BR Traffic",
      "line_content": "BR routes show 60.6% same fare, a strong 37.6% MSE-lower share, and minimal MSE-higher at 1.7%."
    },
    {
      "line_title": "Non-BR",
      "line_content": "Non-BR holds 62.2% same fare, 29.4% lower on MSE, and a comparatively higher 8.2% MSE-higher segment."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "65% of fares match the airline site, with about 30% lower on MSE and 5.5% falling above airline rates."
    },
    {
      "line_title": "Far Out",
      "line_content": "56% of prices align, 37% are cheaper on MSE, and roughly 6.5% show higher channel pricing."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Frequent Premium",
      "line_content": "GDS fares are higher about 80% of the time across all routes, with a typical mark-up around 20%."
    },
    {
      "line_title": "Extreme in Brazil",
      "line_content": "Brazil routes show GDS fares higher nearly 99% of the time, an exceptionally wide gap."
    },
    {
      "line_title": "Minimal Parity",
      "line_content": "Rates match in under 1% of cases, suggesting few instances of exact price alignment."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS Not Available",
      "line_content": "Roughly 18–20% of website fares are missing on GDS, showing a slight downward trend week over week."
    },
    {
      "line_title": "Same Fare",
      "line_content": "Less than 1% of itineraries match, with negligible changes from previous periods."
    },
    {
      "line_title": "GDS Higher",
      "line_content": "Dominant at ~79–80% of cases. Average premium around 20–22% versus the website."
    },
    {
      "line_title": "GDS Lower",
      "line_content": "Rare, at ~1–2% of instances, offering around 9–13% savings but extremely limited in scope."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "GDS exceeds website fares ~79% of the time at a ~22% mark-up, with ~19% unavailable on GDS."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Long-haul GDS fares run higher ~89% of the time with an ~11% premium, but only ~6% unlisted."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "Brazil (BR)",
      "line_content": "Almost 99% find GDS fares higher, at around a 24–25% price premium, with minimal missing fares."
    },
    {
      "line_title": "Non-Brazil",
      "line_content": "About 69% of GDS fares are higher with an ~19–20% margin; unavailability remains significant near 28%."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Around 80% of these tickets price higher on GDS with a ~19–21% premium, while ~18% do not appear in GDS."
    },
    {
      "line_title": "Far Out",
      "line_content": "Close to 79% of fares list higher in GDS with a ~26% premium, and ~19–20% are unavailable."
    }
  ]
}