{
  "key_channel_insights": [
    {
      "line_title": "OTA",
      "line_content": "Strong alignment with the airline site at 93%, with minimal cheaper (1%) and higher (2%) instances."
    },
    {
      "line_title": "MSE",
      "line_content": "Predominantly lower prices in over 90% of cases; virtually no overpricing."
    },
    {
      "line_title": "GDS",
      "line_content": "Over 90% of fares are higher, indicating a consistent price premium versus the airline's website."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "High Match Rate",
      "line_content": "Over 93% of itineraries align with the website, showing a steady rise from 89% last month."
    },
    {
      "line_title": "Limited OTA-Lower Cases",
      "line_content": "Only around 1% of listings are cheaper than the airline’s site, with discounts near 7–10%."
    },
    {
      "line_title": "OTA-Pricing Premium",
      "line_content": "Around 2% of flights are more expensive, carrying an average premium of 19% vs. the website."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Roughly 3% of fares are missing compared to the website, a slight dip from the prior week."
    },
    {
      "line_title": "Same",
      "line_content": "93% of itineraries match website pricing last week, climbing 4 percentage points month-over-month."
    },
    {
      "line_title": "OTA Lower",
      "line_content": "At 1% frequency, these undercut website fares by roughly 7–10%, though volume remains minimal."
    },
    {
      "line_title": "OTA Higher",
      "line_content": "2% of fares cost more on OTA channels, with an average 19% price premium last week."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Matches exceed 93%, with only 2% of fares higher (about 17% premium) and 1% lower."
    },
    {
      "line_title": "Long Haul",
      "line_content": "‘Same’ makes up nearly 87%, while OTA-higher sits near 9% with a 34% premium in a small sample."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "AT Origin",
      "line_content": "Same pricing is about 94%, up over 2 points from last month, with under 3% OTA-higher listings."
    },
    {
      "line_title": "Non-AT Origin",
      "line_content": "Matches stand above 92%, and the OTA-higher segment near 2–3% shows moderate premiums."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Over 93% align with the airline, while OTA-higher at 1.8% carries around a 14% markup."
    },
    {
      "line_title": "Far Out",
      "line_content": "Same pricing near 92% dominates, but when OTA is higher (3%), the premium averages about 26%."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Consistent Underpricing",
      "line_content": "MSE fares are lower in over 90% of observations. This trend persists across all analyzed periods."
    },
    {
      "line_title": "Sparse Overpricing",
      "line_content": "MSE fares higher than the website remain near 0%. No strong exposure risk."
    },
    {
      "line_title": "Slightly Improved Coverage",
      "line_content": "MSE N/A hovers around 2–3% and shows a mild decline compared to last month."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE N/A",
      "line_content": "Roughly 2–3% of results are missing on MSE, with a small downward shift from last month."
    },
    {
      "line_title": "Same",
      "line_content": "Low frequency (1–3%), slightly down from last week, suggesting fewer identical fares."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "Minimal presence, generally 0%, indicating little risk of being undercut."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "Dominates above 90% in most segments, underscoring a consistently lower channel price."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "MSE Lower remains at ~96%. Same and N/A remain under 3% each."
    },
    {
      "line_title": "Long Haul",
      "line_content": "MSE Lower marks 88–91%. Same occupies 8–12%, while MSE Higher is not observed."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "AT",
      "line_content": "MSE Lower holds 92–97%. Same is small but can rise to about 4–5%."
    },
    {
      "line_title": "Non-AT",
      "line_content": "MSE Lower consistently above 94%. MSE Higher is absent for these ODs."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "MSE Lower is ~95%. Negligible 'MSE Higher' and about 2% 'Same.'"
    },
    {
      "line_title": "Far Out",
      "line_content": "MSE Lower hovers between 91% and 96%. Same jumps from 0.7% last week to nearly 6% this week."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Majority Higher",
      "line_content": "Over 90% of GDS fares are higher than the website, holding steady across all comparisons."
    },
    {
      "line_title": "Minimal N/A",
      "line_content": "GDS unavailability remains low, hovering around 3% or less for most segments."
    },
    {
      "line_title": "Price Differences",
      "line_content": "Short-haul differences run around 0.43%, while long haul shows narrower gaps near 0.05%."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A",
      "line_content": "This category is low but slightly up from last month, remaining under 3% of itineraries."
    },
    {
      "line_title": "SAME",
      "line_content": "Virtually zero, with frequency under 0.2% and no material change week to week."
    },
    {
      "line_title": "GDS LOWER",
      "line_content": "Negligible rates below 0.2% and limited shifts vs previous periods."
    },
    {
      "line_title": "GDS HIGHER",
      "line_content": "Dominant at roughly 97% of itineraries, with small incremental increases vs earlier comparisons."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "GDS fares are higher 97% of the time, stable over recent weeks with a price gap near 0.43%."
    },
    {
      "line_title": "Long Haul",
      "line_content": "GDS fares remain above website in over 90% of cases, trending toward 100% in the last month with a narrower rate difference."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "AT",
      "line_content": "Over 97% of GDS itineraries priced higher than the site; slight month-over-month shift but still dominant."
    },
    {
      "line_title": "Non-AT",
      "line_content": "Similar pattern with around 97% GDS-higher rates; variations remain marginal across weeks."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "GDS fares are higher in roughly 97% of cases, with a moderate 0.36% cost gap vs the website."
    },
    {
      "line_title": "Far Out",
      "line_content": "GDS fares show a 96–98% higher rate frequency, with a larger average price variance of about 0.56%."
    }
  ]
}