{
  "key_channel_insights": [
    {
      "line_title": "OTA Summary",
      "line_content": "OTA fares remain higher overall, at around 59%, but the share of lower fares has risen slightly from ~5% to ~8%."
    },
    {
      "line_title": "MSE Summary",
      "line_content": "MSE typically offers nearly half of fares below the airline’s site, with minimal higher-priced scenarios."
    },
    {
      "line_title": "GDS Summary",
      "line_content": "GDS fares are mostly higher, at ~65% with a modest premium near 1%, but lower fares are steadily increasing."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "OTA Higher Majority",
      "line_content": "Most fares (around 59%) are priced higher on OTA, though slightly down from last month’s ~60%."
    },
    {
      "line_title": "OTA Lower Gaining Ground",
      "line_content": "Lower-priced OTA offers remain under 10% but grew from ~5% last month to ~8% this week."
    },
    {
      "line_title": "Stable Price Parity",
      "line_content": "Same pricing stands near 27% overall, dipping only slightly from the prior month."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Remains marginal at around 5–6%, with minimal shifts across periods."
    },
    {
      "line_title": "Same",
      "line_content": "Holds roughly 27% share, stable week to week but about 2% below last month."
    },
    {
      "line_title": "OTA Lower",
      "line_content": "Expanded from ~5% last month to about 8% now, indicating a small upward trend."
    },
    {
      "line_title": "OTA Higher",
      "line_content": "Dominant at around 59%, though down slightly from last month’s ~60%."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Over 62% of fares appear higher on OTA, while ~8% are priced lower."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Pricing aligns closely with the airline site at 92% parity, leaving minimal OTA-discounted cases."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "KR",
      "line_content": "OTA Higher leads at ~65%, paired with just ~5% of fares priced lower."
    },
    {
      "line_title": "Non-KR",
      "line_content": "More balanced distribution, with ~43% higher on OTA and ~17% coming in lower."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "OTA Higher commands about 61%, parity sits near 24%, and 8% are lower than the airline site."
    },
    {
      "line_title": "Far Out",
      "line_content": "OTA Higher remains ~55%, but lower fares climb to 9%, slightly above close-in levels."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Strong MSE Advantage",
      "line_content": "Nearly half of the itineraries on MSE are consistently cheaper than the airline’s site, with frequencies at roughly 48–49% week over week."
    },
    {
      "line_title": "Minimal Higher Fares",
      "line_content": "Instances of MSE fares above the airline’s site are nearly nonexistent, indicating strong pricing competitiveness."
    },
    {
      "line_title": "Low Non-Availability",
      "line_content": "Less than 1% of cases show no offer on MSE, signaling broad route coverage on the channel."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE Not Found",
      "line_content": "A negligible proportion below 1%, suggesting robust availability for most searched itineraries."
    },
    {
      "line_title": "Same Price",
      "line_content": "Close to half the ODs match carrier fares, reflecting alignment with the airline’s direct pricing."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "Represents nearly half of all cases, with average price differences around 7–9% below the airline’s website."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "Virtually absent in the most recent data, underscoring strong MSE cost advantages."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "MSE is lower in around 45% of cases, with stable week-over-week performance and negligible higher-fare scenarios."
    },
    {
      "line_title": "Long Haul",
      "line_content": "All identified long-haul itineraries show MSE offerings below the airline’s site, reinforcing substantial fare savings."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "Korea (KR)",
      "line_content": "Over 60% of KR routes match airline pricing, while roughly 38% are cheaper on MSE."
    },
    {
      "line_title": "Non-KR",
      "line_content": "Over three-quarters of Non-KR flights are cheaper on MSE; same-price occurrences remain relatively low."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "Almost half of last-minute searches find MSE fares below the airline, with over 45% frequency and stable parity rates."
    },
    {
      "line_title": "Far Out",
      "line_content": "MSE is lower for just over half of advanced bookings, indicating consistent savings even with longer lead times."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Consistent Higher Pricing",
      "line_content": "Across all itineraries, the channel shows a 65% likelihood of being priced higher than the airline site, although the average premium remains near 1%."
    },
    {
      "line_title": "Small But Growing Lower Share",
      "line_content": "GDS-lower instances are less than 10% overall yet are inching up week over week, indicating a slight competitive edge in limited cases."
    },
    {
      "line_title": "Stable Same Pricing Trend",
      "line_content": "Roughly one-quarter of comparisons priced the same, with only minor negative fluctuations from week to month."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A",
      "line_content": "Minimal cases (<1%) where the airline’s website offer was missing in the channel, with negligible week-to-week changes."
    },
    {
      "line_title": "SAME",
      "line_content": "Typically around 25%–28% of fares match the site, with slight declines from last month."
    },
    {
      "line_title": "GDS LOWER",
      "line_content": "Represents under 10% of fares but has slowly risen since last week, suggesting occasional price advantages."
    },
    {
      "line_title": "GDS HIGHER",
      "line_content": "Dominant at ~65%, yet the observed price gap versus the site remains near 1%–1.5%."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "About two-thirds of short-haul fares are higher in GDS, with a small 1% price premium on average, while 8% are lower."
    },
    {
      "line_title": "Long Haul",
      "line_content": "Split nearly evenly between GDS higher and same pricing; there are no instances of GDS being lower or unavailable."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "KR",
      "line_content": "67% of fares are higher than the website, with a slight 1% premium; only 5% of fares reflect lower GDS pricing."
    },
    {
      "line_title": "Non-KR",
      "line_content": "GDS higher stands at ~60%, while the lower rate is notably higher than KR at 17%, indicating varying competition by market."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "67% of quotes are higher on GDS, though the price gap remains modest near 1%; roughly 7% are cheaper week over week."
    },
    {
      "line_title": "Far Out",
      "line_content": "60% higher on GDS, with a 1% to 1.2% premium, while 10% of these fares come in lower than the airline’s site."
    }
  ]
}