{
  "key_channel_insights": [
    {
      "line_title": "OTA Key Insight",
      "line_content": "A marked shift to lower fares observed, with short-haul OTA-lower share rising by about 12%."
    },
    {
      "line_title": "MSE Key Insight",
      "line_content": "Over 90% of fares undercut the website, highlighting a sustained discount advantage for MSE."
    },
    {
      "line_title": "GDS Key Insight",
      "line_content": "More than half of fares matched website levels, with a notable 40% commanding higher prices."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Surge in OTA-Lower",
      "line_content": "OTA-lower frequency jumped by over 5% from the prior week, driven strongly by short-haul markets with a 12% gain."
    },
    {
      "line_title": "Shift in Canada",
      "line_content": "CA markets saw 'same' fares drop 10.76% week over week, offset by an equivalent rise in OTA-lower bookings."
    },
    {
      "line_title": "Stable High Share for Same",
      "line_content": "Despite fluctuations, 'same' still dominates at around 55% overall, reflecting persistent fare alignment."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A",
      "line_content": "Minimal presence under 10% overall, with marginal week-over-week movement across all segments."
    },
    {
      "line_title": "SAME",
      "line_content": "Remains the largest share but dipped in short haul, down 13.44% from the prior week."
    },
    {
      "line_title": "OTA HIGHER",
      "line_content": "Stable at roughly a quarter of records, showing minor declines compared to the previous week."
    },
    {
      "line_title": "OTA LOWER",
      "line_content": "Expanded notably across short-haul and CA markets, registering a 5–12% boost in share."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Significant drop in 'same' coverage (-13.44%), mirrored by a 12.30% jump in OTA-lower frequency."
    },
    {
      "line_title": "Long Haul",
      "line_content": "'Same' rose by 3.25%, while both OTA-higher and OTA-lower posted modest declines."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "CA",
      "line_content": "'Same' share fell more than 10%, replaced almost exactly by OTA-lower gains."
    },
    {
      "line_title": "Non-CA",
      "line_content": "Minimal shifts: 'same' edged up 0.42%, with little movement in OTA-higher or OTA-lower."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "'Same' bookings were down 8.96% versus last week, while OTA-lower rose by 8.46%."
    },
    {
      "line_title": "Far Out",
      "line_content": "'Same' remains near 63%; OTA-lower share stays under 7% with negligible change."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Strong Discount Patterns",
      "line_content": "Over 90% of listed fares on MSE were below the website’s prices across all segments."
    },
    {
      "line_title": "Limited Price Parity",
      "line_content": "Only about 5–10% of fares matched website rates, signaling minimal overlap."
    },
    {
      "line_title": "No Higher Pricing",
      "line_content": "No instances of MSE fares exceeding website pricing were observed."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE N/A",
      "line_content": "No significant data gaps; unlisted fare coverage was insufficient for detailed analysis."
    },
    {
      "line_title": "Same",
      "line_content": "A small portion (5–10%) aligned with the airline site, showing steady week-to-week levels."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "Over 90% cheaper on MSE, offering a 5–7% discount versus the direct site."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "No evidence of MSE fares surpassing airline site prices this period."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "Approx. 92% of MSE fares were cheaper, averaging a 5–6% discount."
    },
    {
      "line_title": "Long Haul",
      "line_content": "88–95% MSE-lower frequency, with about a 7% cost advantage."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "CA Origins",
      "line_content": "84% of fares were lower on MSE by about 4%, indicating a modest discount."
    },
    {
      "line_title": "Non-CA Origins",
      "line_content": "Roughly 99% were cheaper on MSE, with a 7–9% discount internationally."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "MSE discounted fares 90–95% of the time, saving about 6% on short-notice travel."
    },
    {
      "line_title": "Far Out",
      "line_content": "Over 92% were cheaper on MSE, reflecting about a 6–7% discount for advance purchases."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Stable Parity",
      "line_content": "Over half of GDS fares match website pricing, hovering around 55% parity last week."
    },
    {
      "line_title": "Higher vs Lower",
      "line_content": "GDS was higher in 40% of cases and lower in just 4%, indicating a mild premium."
    },
    {
      "line_title": "Minimal Shift",
      "line_content": "Less than 1% monthly swing, suggesting stable positioning."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A",
      "line_content": "No significant availability gaps reflected in this data set."
    },
    {
      "line_title": "Same",
      "line_content": "Slight majority at 55%, with little week-to-week variance."
    },
    {
      "line_title": "GDS Higher",
      "line_content": "About 41%, indicating a small premium compared to the website."
    },
    {
      "line_title": "GDS Lower",
      "line_content": "Remains under 4%, with no notable changes over recent weeks."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "56% parity, 39% higher, and about 5% lower, reflecting moderate price elevation."
    },
    {
      "line_title": "Long Haul",
      "line_content": "54% matched, 44% higher, and only 2% lower, revealing closely aligned fares."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "CA",
      "line_content": "97% matched exactly, showcasing near-universal parity in domestic origination."
    },
    {
      "line_title": "Non-CA",
      "line_content": "GDS was higher 87% of the time, with 7% matching and 7% lower, indicating a wider gap abroad."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close In",
      "line_content": "57% parity, 41% higher, and 2% lower, highlighting limited discounts for late bookings."
    },
    {
      "line_title": "Far Out",
      "line_content": "Just over half matched, around 39% were higher, while roughly 9% offered lower rates."
    }
  ]
}