{
  "key_channel_insights": [
    {
      "line_title": "OTA Parity Leadership",
      "line_content": "70.34% of OTA fares matched Royal Air Maroc’s website last week, while 28.05% carried a modest 0.52% premium, reflecting strong parity with a slight upward skew."
    },
    {
      "line_title": "MSE Discount Dominance",
      "line_content": "MSE offered lower fares on 85.25% of routes at an average –0.06% gap versus the website, with only 12.6% of itineraries priced above web rates."
    },
    {
      "line_title": "GDS Coverage Shortfall",
      "line_content": "69.44% of origin-destination offers were unavailable on GDS, and under 1% of listed itineraries deviated from website pricing."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Price Parity Dominates",
      "line_content": "70.34% of itineraries on OTA matched Royal Air Maroc’s website fares last week, underscoring strong alignment between channels."
    },
    {
      "line_title": "Premium Skew Rising",
      "line_content": "OTA prices exceeded web fares on 28.05% of routes, a 1.63pp week-over-week increase, with an average markup of 0.52%."
    },
    {
      "line_title": "Negligible Undercuts",
      "line_content": "OTA undercut web prices on only 0.13% of routes, delivering an average discount of just -0.01%."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "Missing Listings",
      "line_content": "1.48% of routes lacked an OTA offer last week, up 0.80pp from the prior week."
    },
    {
      "line_title": "Price Parity",
      "line_content": "70.34% of routes showed identical fares, down 2.43pp week-over-week and 0.92pp month-over-month."
    },
    {
      "line_title": "OTA Premiums",
      "line_content": "28.05% of routes were higher on OTA, up 1.63pp w/w, with a consistent 0.52% average premium."
    },
    {
      "line_title": "OTA Discounts",
      "line_content": "Only 0.13% of routes featured lower OTA fares, with a negligible -0.01% average discount."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul Trends",
      "line_content": "Short-haul routes mirrored overall OTA behavior: 70.34% parity, 28.05% higher (up 1.63pp w/w) and minimal lower occurrences."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "MA Origins",
      "line_content": "From Morocco, 60.15% of routes matched web fares, 38.30% were higher on OTA (avg +0.53%, +1.38pp w/w) and 0.19% lower."
    },
    {
      "line_title": "Non-MA Origins",
      "line_content": "Outside Morocco, parity prevailed on 93.42% of routes, 4.82% were higher (avg +0.28%) and no significant lower-fare instances."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "For bookings close to departure, 71.80% matched web fares, 26.20% were higher (avg +0.51%) and 0.20% lower."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Far-out bookings saw 67.07% parity and a 31.71% share of higher OTA fares (avg +0.53%, +1.91pp w/w)."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Consistent Discounting",
      "line_content": "MSE shows lower fares in 85% of cases last week, maintaining a –0.06% average price gap versus the website."
    },
    {
      "line_title": "Declining Premium Instances",
      "line_content": "Fares above website rates on MSE fell to 12.6% share last week, down 1.5ppt from the prior week and 1.7ppt from the previous month."
    },
    {
      "line_title": "Rising Price Parity",
      "line_content": "Exact price matches increased to 1.9% share, up from 0.7% a month ago, indicating tighter parity between channels."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "Channel Lower Prevalence",
      "line_content": "85.25% of routes featured lower MSE fares last week, a 0.4ppt weekly and 1.2ppt monthly increase, underscoring strong discounting."
    },
    {
      "line_title": "Channel Higher Decline",
      "line_content": "Routes where MSE fares exceeded website rates dropped to 12.6% share, down 1.47ppt week-over-week and 1.72ppt month-over-month."
    },
    {
      "line_title": "Price Parity Uptick",
      "line_content": "Price matches on MSE rose to 1.88% of routes last week, nearly doubling the prior week’s level by 0.93ppt."
    },
    {
      "line_title": "Minimal Unavailable Instances",
      "line_content": "Routes not found on MSE remain negligible at 0.27% share, showing stability versus the prior week."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short-Haul Consistency",
      "line_content": "Short-haul routes mirror overall MSE trends with 85.25% lower fares last week and a –0.06% average price gap versus the website."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "Domestic Discounting Strength",
      "line_content": "Within Morocco, MSE fares were lower in 78.96% of routes last week, up 1.2ppt month-over-month, while higher-fare instances declined to 18.15% share."
    },
    {
      "line_title": "International Discount Dominance",
      "line_content": "On non-Moroccan origins, MSE fares were lower in 99.56% of routes last week, indicating near-universal discounting on the channel."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Last-Minute Discounting",
      "line_content": "Close-in bookings saw 86.23% lower fares on MSE last week, up 0.6ppt week-over-week, with an average –0.06% price gap."
    },
    {
      "line_title": "Advance Booking Pricing",
      "line_content": "Far-out bookings had lower fares in 83.27% of cases, stable week-over-week, while higher-fare share fell 1.6ppt to 14.29%."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Prevalent GDS Coverage Gap",
      "line_content": "Last week, 69.4% of AT’s origin-destination offers were not listed on GDS—a 0.12pp week-over-week and 0.44pp month-over-month decline in channel coverage."
    },
    {
      "line_title": "Disproportionate Morocco Absence",
      "line_content": "All Moroccan-origin itineraries (100% N/A) are absent from GDS, while non-MA routes maintain 97.4% price parity."
    },
    {
      "line_title": "Negligible Price Variance",
      "line_content": "Under 1% of itineraries show deviations on GDS: 0.67% priced higher at +0.20% average and 0.13% priced lower at –0.02% differential."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "Coverage (GDS N/A)",
      "line_content": "69.44% of all OD offers were unavailable on GDS last week, down 0.12pp WoW and 0.44pp MoM."
    },
    {
      "line_title": "Price Parity (SAME)",
      "line_content": "29.76% of itineraries matched website pricing, up 0.12pp WoW and 1.24pp MoM."
    },
    {
      "line_title": "GDS Markups",
      "line_content": "0.67% of offers were priced higher on GDS with an average +0.20% premium, edging down 0.01pp WoW and 0.94pp MoM."
    },
    {
      "line_title": "GDS Discounts",
      "line_content": "0.13% of offers were cheaper on GDS at –0.02% differential, stable WoW and up 0.13pp MoM."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short-Haul Routes",
      "line_content": "Short-haul ODs mirror overall trends with 69.44% unlisted, 29.76% parity, 0.67% markups and 0.13% discounts last week."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "Morocco Origins",
      "line_content": "100% of Moroccan-origin routes are absent from GDS, with no week-over-week or month-over-month change."
    },
    {
      "line_title": "Non-MA Origins",
      "line_content": "Non-MA routes achieve 97.37% price parity on GDS, up 3.12pp MoM; 2.19% saw markups and 0.44% saw discounts last week."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "68.46% of close-in itineraries were not listed on GDS (–0.16pp WoW, –0.60pp MoM), with 30.34% parity, 1.00% markups (+0.20% avg) and 0.20% discounts."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "71.43% of far-out itineraries were not listed (flat WoW, –0.12pp MoM), 28.57% parity and no markups last week, though MoM share rose to 1.22% at a +0.30% average uplift."
    }
  ]
}