{
  "key_channel_insights": [
    {
      "line_title": "OTA Premium Dominance",
      "line_content": "94.18% of itineraries on OTA carried an average +0.36% premium versus Avianca’s site, peaking at +0.39% for far-out bookings with negligible discounts."
    },
    {
      "line_title": "MSE Parity and Discounts",
      "line_content": "MSE maintains price parity 75.5% of the time while offering discounts on 23.2% of itineraries and only a 0.6% share of premiums."
    },
    {
      "line_title": "GDS Markup Consistency",
      "line_content": "GDS shows higher fares on 99.23% of routes with a stable +0.44% markup and almost no discounts (0.03%)."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Persistent OTA Premium",
      "line_content": "Last week, 94.18% of itineraries on OTA were priced higher than the Avianca site, carrying an average +0.36% markup despite a slight 1.05-point week-over-week dip."
    },
    {
      "line_title": "Stronger Far-Out Markup",
      "line_content": "Far-out bookings showed the highest OTA premium: 97.64% priced higher with an average +0.39% difference, underscoring elevated channel markups on longer lead-time sales."
    },
    {
      "line_title": "Negligible OTA Discounts",
      "line_content": "Only 2.35% of itineraries were cheaper on OTA last week, up 0.50 points W/W but still minimal, with an average −0.04% discount versus Avianca’s site."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A Coverage",
      "line_content": "1.96% of routes lacked an OTA offer last week, a 0.18-point increase from the prior week and a 0.22-point decrease from the prior month, signaling stable distribution coverage."
    },
    {
      "line_title": "Exact Parity (SAME)",
      "line_content": "1.51% of itineraries matched site fares on OTA last week, rising 0.36 points W/W and 0.47 points M/M, reflecting gradual improvement in price alignment."
    },
    {
      "line_title": "OTA Higher",
      "line_content": "94.18% of listings carried an OTA premium last week, down 1.05 points W/W and 1.29 points M/M, with an average markup of +0.36%."
    },
    {
      "line_title": "OTA Lower",
      "line_content": "2.35% of fares were lower on OTA last week, up 0.50 points W/W and 1.04 points M/M, though discounts remain marginal at −0.04% on average."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short-Haul Premium",
      "line_content": "Short-haul routes saw 94.18% priced higher on OTA last week (−1.07 points W/W, −1.40 points M/M) with a +0.38% average markup."
    },
    {
      "line_title": "Long-Haul Dynamics",
      "line_content": "Long-haul had 94.87% OTA markup last week (flat W/W, +1.32 points M/M) but carried a minimal +0.04% average premium."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "Colombia Origins",
      "line_content": "93.82% of Colombia ODs were priced higher on OTA last week (−1.19 points W/W, −1.53 points M/M) with a +0.35% average premium."
    },
    {
      "line_title": "Non-Colombia Origins",
      "line_content": "96.39% of non-Colombia ODs carried an OTA premium last week (−0.02 points W/W, +0.25 points M/M) at an average +0.38% markup."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "92.09% of close-in itineraries were higher on OTA last week (−1.47 points W/W, −1.55 points M/M) with a +0.34% average price increase."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "97.64% of far-out itineraries showed an OTA premium last week (−0.34 points W/W, −0.80 points M/M) averaging +0.39% above site fares."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "High Price Parity Maintained",
      "line_content": "MSE listings match Avianca’s website price 75.5% of the time, reflecting stable parity with a modest 0.6% weekly gain."
    },
    {
      "line_title": "Consistent Discounting",
      "line_content": "Approximately 23.2% of listings on MSE undercut the website fare, indicating persistent channel discounts and a 1.5% increase versus last month."
    },
    {
      "line_title": "Minimal Premium Surcharges",
      "line_content": "Only 0.6% of itineraries are priced higher on MSE, marking a 7% monthly decline in channel premiums."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "Missing Listings",
      "line_content": "0.68% of itineraries were not found on MSE in the last week, up 12% week-on-week but down 43% month-on-month."
    },
    {
      "line_title": "Price Parity",
      "line_content": "75.49% of listings match the airline’s website price, rising 0.6% versus last week but down 1% compared to the prior month."
    },
    {
      "line_title": "Lower Prices",
      "line_content": "23.22% of itineraries are priced lower on MSE, a 0.7% drop week-on-week but a 1.5% increase month-on-month."
    },
    {
      "line_title": "Higher Prices",
      "line_content": "Only 0.61% of listings are more expensive on MSE, decreasing 1% week-over-week and 7% month-over-month."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul Discounting",
      "line_content": "Short-haul itineraries see MSE prices undercutting the website in 23.12% of cases, up 2.5% month-on-month, while parity remained around 75.8%."
    },
    {
      "line_title": "Long Haul Parity Gains",
      "line_content": "Long-haul listings achieved price parity in 70.3% of cases, an 18.4% month-on-month increase driven by a 17.7% decline in undercut frequency."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "CO Market Stability",
      "line_content": "For Colombia-origin itineraries, 76.3% achieved parity last week, slightly up 0.3% week-on-week but down 3.0% month-on-month, while undercuts edged up 3.4% versus last month."
    },
    {
      "line_title": "Non-CO Parity Improvement",
      "line_content": "Non-Colombia origins saw parity rise to 70.8%, up 10.2% month-on-month, with undercuts falling 9.3%, indicating improved price alignment."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close-In Booking Dynamics",
      "line_content": "Close-in bookings have 73.2% parity, down 1.1% month-on-month, and undercuts increased 2.1%, reflecting greater discounting in last-minute inventory."
    },
    {
      "line_title": "Far-Out Parity Peak",
      "line_content": "Far-out bookings exhibit the highest parity at 79.2%, though down 0.9% from last month, with undercuts at 19.9%, indicating stable long-lead inventory pricing."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Universal GDS Premium",
      "line_content": "GDS channel listed higher fares for 99.23% of itineraries last week, carrying an average 0.44% markup over the website."
    },
    {
      "line_title": "Minimal Discount Instances",
      "line_content": "GDS offered lower fares on just 0.03% of routes, delivering a negligible 0.12% average discount that remains stable."
    },
    {
      "line_title": "Stable Premium Trend",
      "line_content": "The average GDS markup narrowed slightly from 0.46% in the prior week to 0.44% last week, aligning closely with the 0.45% monthly average."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "Channel Unavailable",
      "line_content": "GDS lacked offers for 0.74% of routes last week, marking a 0.02-point improvement week-on-week and a 0.60-point improvement month-on-month."
    },
    {
      "line_title": "Price Parity Absent",
      "line_content": "Exact price parity between GDS and the website did not occur in any itineraries last week, underscoring consistent discrepancies."
    },
    {
      "line_title": "GDS Premium Dominance",
      "line_content": "Higher fares appeared on 99.23% of itineraries, up 0.02 points from the prior week and 0.60 points from the prior month."
    },
    {
      "line_title": "GDS Discount Rarity",
      "line_content": "Lower fares on GDS remained rare at 0.03% frequency, with an average discount of just 0.12%, unchanged week-to-week."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short-Haul Premium",
      "line_content": "GDS listed higher fares on 99.49% of short-haul ODs last week with a 0.45% markup, up 0.08 points week-on-week and 0.66 points month-on-month."
    },
    {
      "line_title": "Long-Haul Premium",
      "line_content": "Long-haul routes saw 94.87% higher fares on GDS last week, with a modest 0.12% premium, down 0.61 points week-on-week."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "Home-Market Premium",
      "line_content": "In Colombia departures, GDS listed higher fares on 99.77% of ODs with a 0.43% average markup, up 0.08 points week-on-week and 0.69 points month-on-month."
    },
    {
      "line_title": "International Premium",
      "line_content": "For non-Colombia origins, GDS showed higher fares on 96.60% of routes with a 0.50% markup, rising 0.20 points week-on-week and 0.47 points month-on-month."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In Premium",
      "line_content": "GDS listed higher close-in fares on 98.86% of itineraries last week with a 0.42% markup, dipping 0.04 points week-on-week and 0.10 points month-on-month."
    },
    {
      "line_title": "Far-Out Premium",
      "line_content": "Far-out bookings saw higher GDS fares on 99.83% of itineraries with a 0.47% markup, gaining 0.18 points week-on-week and 1.74 points month-on-month."
    }
  ]
}