{
  "key_channel_insights": [
    {
      "line_title": "OTA Price Divergence",
      "line_content": "OTA fares show increasing premiums, with 37.2% priced above the website last week—up 1.6 pp WoW—and parity slipping to 62.0%, while discounts remain negligible."
    },
    {
      "line_title": "MSE Consistent Discount",
      "line_content": "MSE offers dominate with 99.62% of itineraries priced below the website—averaging a 0.06% discount—and near-complete listing coverage."
    },
    {
      "line_title": "GDS Premium Shift",
      "line_content": "GDS sees 36.7% of fares at a premium—up 1.5 pp WoW—with parity down to 63.0% and listing coverage at 99.8%, while discounts are rare."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Rising OTA Premiums",
      "line_content": "In the latest week, 37.2% of OTA fares were higher than website rates, up 1.6 percentage points week-over-week and 3.9 points month-over-month, with an average premium of 0.02%."
    },
    {
      "line_title": "Declining Rate Parity",
      "line_content": "Price parity on the OTA channel slipped to 62.0% last week, declining by 1.9 points week-over-week and 3.6 points month-over-month."
    },
    {
      "line_title": "Negligible OTA Discounts",
      "line_content": "OTA discounts remain rare at 0.08% of itineraries, delivering an average discount of 0.28% when available."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A Frequency",
      "line_content": "Itineraries missing on OTA represented 0.68% last week, slightly up from 0.53% week-ago and down from 0.76% month-ago."
    },
    {
      "line_title": "Rate Parity Levels",
      "line_content": "62.03% of itineraries matched website fares last week, marking a 1.86-point week-over-week and 3.59-point month-over-month decline."
    },
    {
      "line_title": "OTA Premium Share",
      "line_content": "37.21% of OTA fares exceeded website prices last week, increasing by 1.63 points week-over-week and 3.90 points month-over-month with a 0.02% average premium."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short-Haul Discrepancies",
      "line_content": "Short-haul routes saw 39.26% of OTA fares priced higher last week (up 1.73 points w/w), while 60.02% maintained parity, with premiums averaging 0.02%."
    },
    {
      "line_title": "Long-Haul Parity",
      "line_content": "Long-haul itineraries exhibited 100% price parity on OTA last week, with no instances of higher or lower fares."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "Domestic (IT) Patterns",
      "line_content": "For Italy-origin routes, 43.27% of OTA fares were higher last week (up 2.01 points w/w) versus 56.11% in parity, with premiums averaging 0.02%."
    },
    {
      "line_title": "International (Non-IT) Patterns",
      "line_content": "Non-IT origins showed 97.85% rate parity last week, 0.54% of fares higher on OTA (0.12% average premium) and negligible discounts."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Booking Trends",
      "line_content": "In the close-in window, 26.29% of OTA fares were higher last week (up 2.14 points w/w) and 72.69% matched website rates, with a 0.02% average premium."
    },
    {
      "line_title": "Far-Out Booking Trends",
      "line_content": "For far-out bookings, 58.86% of OTA fares exceeded website prices last week (up 0.79 points w/w) versus 40.91% in parity, with a 0.02% average premium."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Dominant Lower Pricing",
      "line_content": "In the MSE channel last week, 99.62% of itineraries were priced below the website, yielding an average discount of 0.06%."
    },
    {
      "line_title": "Minimal Availability Gaps",
      "line_content": "Only 0.15% of route pairs lacked MSE offers last week, improving from 0.68% missing listings a month ago."
    },
    {
      "line_title": "Consistent Monthly Gain",
      "line_content": "Lower-priced MSE offers rose by 0.38 percentage points versus the previous month, reinforcing a stable cost advantage."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "Offers Missing (MSE N/A)",
      "line_content": "0.15% of ODs had no MSE listing last week, down from 0.68% a month prior."
    },
    {
      "line_title": "Parity Pricing (SAME)",
      "line_content": "0.23% of fares matched the website price on MSE, unchanged from prior week and month."
    },
    {
      "line_title": "Channel Lower",
      "line_content": "99.62% of fares were lower on MSE, consistent with a 0.06% average discount week-over-week and month-over-month."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "99.60% of short-haul ODs were cheaper on MSE last week, with a stable 0.06% discount despite a 0.32-point dip from the prior week."
    },
    {
      "line_title": "Long Haul",
      "line_content": "All long-haul routes (100%) showed lower MSE fares, delivering a slightly deeper 0.08% average discount than short haul."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "Originating in Italy",
      "line_content": "99.56% of Italy-origin ODs featured lower MSE pricing with a modest 0.05% discount, recovering 0.35 points week-over-week."
    },
    {
      "line_title": "Non-Italy Origins",
      "line_content": "100% of non-Italy routes were cheaper on MSE, providing an average 0.08% saving versus the website."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "99.66% of close-in itineraries were lower on MSE, maintaining a 0.06% discount and showing stable availability week-on-week."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "99.55% of far-out itineraries were cheaper on MSE, rebounding from a 0.45-point dip last week and preserving a 0.06% savings."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Near-complete Coverage",
      "line_content": "GDS shows route availability for 99.8% of itineraries, leaving only 0.2% with no listing."
    },
    {
      "line_title": "Rising GDS Premiums",
      "line_content": "36.7% of fares were priced higher on GDS last week, up 1.5 pp week-over-week and 4.0 pp month-over-month, with a modest 0.02% average markup."
    },
    {
      "line_title": "Declining Parity",
      "line_content": "63.0% of GDS fares matched the website last week, sliding 1.6 pp WoW and 3.6 pp MoM."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "Coverage Gaps",
      "line_content": "Listings missing on GDS accounted for just 0.23% of itineraries, underscoring near-full channel availability."
    },
    {
      "line_title": "Parity Frequency",
      "line_content": "Price parity covered 63.0% of itineraries last week, down 1.6 pp from the prior week and 3.6 pp month-over-month."
    },
    {
      "line_title": "Premium Share",
      "line_content": "Fares at a higher rate on GDS represented 36.7% of listings, rising 1.5 pp WoW and 4.0 pp MoM."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short-Haul Dynamics",
      "line_content": "Short-haul routes saw 61.0% parity (down 1.7 pp WoW) and 38.7% priced higher, reflecting a 0.02% average premium."
    },
    {
      "line_title": "Long-Haul Parity",
      "line_content": "All long-haul itineraries (100%) matched website fares on GDS with no premiums or discounts."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "Domestic (IT) Origins",
      "line_content": "Within Italy, 57.0% of GDS fares matched the website (down 1.9 pp WoW) while 42.6% carried a small premium."
    },
    {
      "line_title": "International Origins",
      "line_content": "Non-IT origins exhibited 99.5% parity and just 0.5% of fares at a 0.10%–0.32% premium."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "Bookings within 7 days showed 73.9% parity (down 2.3 pp WoW) and 25.7% priced higher with a 0.02% average premium."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Bookings >7 days out had 41.5% parity and 58.5% of fares with a 0.02% average premium, up 0.5 pp WoW."
    }
  ]
}