{
  "key_channel_insights": [
    {
      "line_title": "OTA Premium Dominance",
      "line_content": "95.15% of routes were priced higher on OTAs last week, commanding a modest average uplift of 0.29% versus Frontier’s website."
    },
    {
      "line_title": "MSE Discount Surge",
      "line_content": "MSE undercut Frontier’s site on 28.0% of itineraries last week, marking an 18.5% increase over the prior month, while surcharges fell sharply to 52.9%."
    },
    {
      "line_title": "GDS Consistent Markup",
      "line_content": "95.27% of GDS listings carried a premium over Frontier’s site last week, averaging a 0.28% uplift with undercuts in only 0.98% of cases."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Prevalent OTA Premium",
      "line_content": "95.15% of routes were priced higher on the OTA last week, commanding an average premium of 0.29% over the airline’s site."
    },
    {
      "line_title": "Scarce OTA Discounts",
      "line_content": "Only 1.33% of itineraries showed lower OTA fares last week, up 0.52pp versus the prior week."
    },
    {
      "line_title": "Listings Gaps Persist",
      "line_content": "3.52% of origin–destination pairs were absent on the OTA last week, a slight 0.12pp dip week-on-week but a 0.40pp rise month-on-month."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "Missing OTA Listings",
      "line_content": "3.52% of ODs had no OTA offer last week, down 0.12pp from the prior week but up 0.40pp versus last month."
    },
    {
      "line_title": "Negligible Price Parity",
      "line_content": "Fares matched between the OTA and the airline site in 0.00% of cases last week, a 0.23pp decrease week-on-week."
    },
    {
      "line_title": "OTA Price Premium",
      "line_content": "95.15% of routes carried higher fares on the OTA last week, a 0.16pp decline week-on-week with an average uplift of 0.29%."
    },
    {
      "line_title": "OTA Discount Rate",
      "line_content": "Only 1.33% of itineraries were cheaper on the OTA last week, up 0.52pp week-on-week with discounts averaging 0.20%."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short-Haul Dynamics",
      "line_content": "Short-haul routes saw 96.43% priced higher on the OTA last week, with a 0.30% average premium and only 1.09% receiving discounts."
    },
    {
      "line_title": "Long-Haul Variations",
      "line_content": "91.46% of long-haul itineraries were higher on the OTA last week, carrying a 0.23% premium while discounts rose to 2.02%."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "US Origins",
      "line_content": "96.35% of US-origin routes appeared at a premium on the OTA last week, with a 0.29% average uplift and 1.24% showing discounts."
    },
    {
      "line_title": "Non-US Origins",
      "line_content": "Non-US itineraries showed 78.63% priced higher on the OTA, with a 0.24% premium and 2.56% receiving discounts."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "Within 0–14 days of departure, 94.71% of fares were higher on the OTA last week, with a 0.26% average premium and 0.67% discounted."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Bookings made 90+ days out saw 96.12% priced higher on the OTA, with a 0.34% premium and 2.77% lower-priced fares."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Surge in MSE Discounts",
      "line_content": "Last week MSE undercut Frontier’s site on 28.0% of itineraries, an 18.5% increase versus the previous month."
    },
    {
      "line_title": "Steep Decline in Surcharges",
      "line_content": "Instances of MSE listing higher prices fell to 52.9% last week, down roughly 30% compared to both the prior week and month."
    },
    {
      "line_title": "Consistent Price Alignment",
      "line_content": "Identical pricing on MSE held steady at 19.0%, up 15.2% week-over-week and 12.2% month-over-month."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "Missing Listings",
      "line_content": "MSE listings not found on Frontier’s site remain negligible at 0.12%, with no meaningful change week-over-week."
    },
    {
      "line_title": "Matched Pricing",
      "line_content": "Exactly matching fares account for 19.0% of listings, a 15.2% weekly gain reflecting improved parity."
    },
    {
      "line_title": "MSE Higher Prices",
      "line_content": "The share of itineraries where MSE prices exceed website fares declined from 83.6% to 52.9% week-over-week, with an average premium of 0.26%."
    },
    {
      "line_title": "MSE Lower Prices",
      "line_content": "Itineraries where MSE undercuts the site climbed from 12.5% to 28.0% week-over-week, delivering an average discount of 0.16%."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short-Haul Competitiveness",
      "line_content": "On short-haul routes, MSE undercuts site fares in 29.9% of cases, up 17.6% week-over-week, while higher-price listings plunged 32.9%."
    },
    {
      "line_title": "Long-Haul Trends",
      "line_content": "Long-haul saw discounts in 22.5% of itineraries, up 9.6% week-over-week, alongside a 24.5% drop in surcharge instances."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "US Origin Dynamics",
      "line_content": "For US departures, MSE underpricing occurs in 29.1% of itineraries, up 16.2% week-over-week, and surcharge cases fell by 31.4%."
    },
    {
      "line_title": "Non-US Origin Patterns",
      "line_content": "Non-US routes show limited MSE discounting at 12.9%, a modest 4.5% weekly increase, while higher-price listings declined 20.9%."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close-In Booking Edge",
      "line_content": "Tickets booked within 14 days see the highest discount rate at 30.2%, up 13.8% week-over-week, and a 27.8% drop in surcharge listings."
    },
    {
      "line_title": "Far-Out Booking Pattern",
      "line_content": "Far-out bookings carry the highest surcharge rate at 57.9%, down 37.0% week-over-week, with undercuts at 23.4%."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Predominant Higher Pricing",
      "line_content": "95.27% of all itineraries in GDS last week were priced above Frontier’s website, underscoring a marked premium."
    },
    {
      "line_title": "Stable Premium Trend",
      "line_content": "GDS higher-priced listings climbed by 1.87pp week-over-week, delivering a 0.28% average premium consistent with the monthly trend."
    },
    {
      "line_title": "Far-Out Booking Premium",
      "line_content": "Itineraries booked far in advance showed the highest GDS premium at 0.35% on average, with 96.86% priced above the site."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS Not Available",
      "line_content": "3.75% of routes lacked a GDS offering last week, slightly down from 3.88% the prior week."
    },
    {
      "line_title": "No Identical Pricing",
      "line_content": "No itineraries displayed exact price parity between the website and GDS last week, indicating systematic deviations."
    },
    {
      "line_title": "GDS Higher Incidence",
      "line_content": "95.27% of itineraries were higher-priced on GDS last week, up 1.87pp week-over-week with a 0.28% premium."
    },
    {
      "line_title": "GDS Lower Incidence",
      "line_content": "Only 0.98% of itineraries were cheaper in GDS versus the website, down 1.45pp week-over-week with a −0.18% average discount."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short-Haul Premiums",
      "line_content": "96.89% of short-haul routes were higher-priced in GDS last week, up 2.06pp week-over-week with a 0.30% average premium."
    },
    {
      "line_title": "Long-Haul Premiums",
      "line_content": "90.58% of long-haul routes carried a GDS premium, rising 1.45pp week-over-week and averaging a 0.23% uplift."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "US Origin Premiums",
      "line_content": "97.65% of US ODs were higher-priced in GDS last week, a 2.06pp gain week-over-week, with a 0.28% average premium."
    },
    {
      "line_title": "Non-US Origin Variance",
      "line_content": "62.93% of non-US routes were higher in GDS last week, yielding a 0.26% premium, while only 2.59% registered lower prices."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In Booking Premium",
      "line_content": "94.54% of itineraries booked close-in were higher-priced in GDS, up 3.18pp week-over-week with a 0.25% uplift."
    },
    {
      "line_title": "Far-Out Booking Premium",
      "line_content": "96.86% of far-out bookings carried a GDS premium, down 0.95pp week-over-week but with the highest uplift of 0.35%."
    }
  ]
}