{
  "key_channel_insights": [
    {
      "line_title": "OTA Pricing Premiums",
      "line_content": "OTA channels price 95.71% of itineraries above the direct website with an average premium of 0.18%, while only 1.44% offer discounts and missing listings have fallen to 2.32%."
    },
    {
      "line_title": "MSE Parity Strength",
      "line_content": "MSE achieves price parity in 54.6% of itineraries with minimal 3.9% premiums and 41.4% undercuts averaging a 0.11% discount, and only 0.2% of routes are unavailable."
    },
    {
      "line_title": "GDS Coverage Gaps",
      "line_content": "GDS lacks 95.84% of offers, with 3.88% of listed itineraries marked up by 0.22% and virtually no discounts, indicating significant content absence."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Dominant OTA Price Premiums",
      "line_content": "In the latest week, 95.71% of itineraries on OTA were priced above the website, reflecting a steady premium of 0.18% compared to both prior week and month."
    },
    {
      "line_title": "Minimal OTA Discounts",
      "line_content": "OTA offered lower fares in just 1.44% of cases last week, up 0.41 pp week-over-week, with an average discount of 0.17%."
    },
    {
      "line_title": "Reduced Listing Gaps",
      "line_content": "Website offers gone missing on OTA fell to 2.32% last week, down 0.42 pp from the previous week."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA Higher Prevalence",
      "line_content": "OTA fares exceeded website prices in 95.71% of itineraries last week, unchanged week-over-week and up 1.25 pp month-over-month, at a +0.18% average premium."
    },
    {
      "line_title": "OTA Lower Frequency",
      "line_content": "Lower OTA fares occurred in 1.44% of itineraries last week, increasing 0.41 pp versus prior week, delivering a –0.17% average discount."
    },
    {
      "line_title": "Price Parity Instances",
      "line_content": "Exact fare matches accounted for 0.52% of itineraries last week, a slight uptick from 0.48% week-ago, with negligible price variance."
    },
    {
      "line_title": "Unavailable Offers",
      "line_content": "2.32% of website-listed itineraries were not found on OTA last week, improving by 0.42 pp from the previous week."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short-Haul Premiums",
      "line_content": "Short-haul routes saw OTA prices higher in 96.48% of cases last week, stable week-over-week, with a +0.18% average uplift."
    },
    {
      "line_title": "Long-Haul Variance",
      "line_content": "Long-haul itineraries had OTA higher fares in 78.70% of cases last week, up 1.43 pp week-over-week, averaging a +0.17% premium."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "Brazilian Origins",
      "line_content": "For Brazil-origin itineraries, 97.16% were priced higher on OTA last week (–0.38 pp week-over-week), at a +0.18% mean premium."
    },
    {
      "line_title": "Non-Brazil Origins",
      "line_content": "Non-Brazilian origins saw 62.50% of fares higher on OTA last week (+2.84 pp), with 17.31% lower at an average –0.09% discount."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "Close-in bookings had OTA higher prices in 95.14% of itineraries last week, flat week-over-week, with a +0.18% average difference."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Far-out bookings recorded OTA higher fares in 96.68% of itineraries last week (–0.32 pp week-over-week), at a +0.17% average premium."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Growing Price Parity",
      "line_content": "MSE fare parity reached 54.6% last week, marking a ~7% increase week-over-week and month-over-month, indicating stronger alignment with direct fares."
    },
    {
      "line_title": "Negligible Channel Premiums",
      "line_content": "Only 3.9% of itineraries are priced higher on MSE than G3’s site, down 4.5% from the prior week, showing reduced risk of overpricing."
    },
    {
      "line_title": "Consistent Undercut Discounts",
      "line_content": "41.4% of fares are lower on MSE, offering an average discount of 0.11%, despite a 2.6% decrease in undercut frequency week-over-week."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "Missing Offers Rare",
      "line_content": "Just 0.2% of ODs are unavailable on MSE, with negligible week-over-week change, ensuring near-complete distribution coverage."
    },
    {
      "line_title": "Price Parity Dominant",
      "line_content": "54.6% of fares match direct-site prices, up 6.97% week-over-week and 6.82% month-over-month, reflecting increasing consistency."
    },
    {
      "line_title": "Minimal Channel Premiums",
      "line_content": "MSE premiums account for only 3.9% of listings and declined 4.52% from the prior week, minimizing overpricing exposure."
    },
    {
      "line_title": "Slight Undercut Reduction",
      "line_content": "41.4% of fares undercut website pricing, down 2.58% week-over-week, with an average discount of 0.11%."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul Parity",
      "line_content": "Short-haul routes show 54.0% price parity, up 6.6% week-over-week, with 42.0% undercuts (–2.3%) at an average discount of 0.12%."
    },
    {
      "line_title": "Long Haul Alignment",
      "line_content": "Long-haul parity leads at 66.7%, up 15.8% week-over-week and 19.4% month-over-month, while undercuts fell to 27.8% (–9.5%)."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "Domestic Parity Strong",
      "line_content": "Brazil-origin routes match 55.7% of direct fares, up 6.9% week-over-week, with 40.7% undercuts at a 0.12% discount."
    },
    {
      "line_title": "International Undercuts Prevail",
      "line_content": "Non-Brazil routes have just 27.9% parity but 57.7% undercuts (–9.3% week), reflecting aggressive discounting on limited sample ODs."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close-In Variability",
      "line_content": "Close-in bookings show 47.2% parity (up 4.4%) and 48.3% undercuts (–0.5%) at a 0.11% average discount."
    },
    {
      "line_title": "Far-Out Parity Peak",
      "line_content": "Far-out bookings deliver 68.1% price parity, up 11.6% week-over-week, with undercuts falling to 28.5% (–6.3%)."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "High GDS Absence",
      "line_content": "GDS channel missing website offers for 95.84% of OD pairs last week, up 0.53 percentage points from the prior week."
    },
    {
      "line_title": "Consistent GDS Premium",
      "line_content": "3.88% of listings on GDS were priced above the website, with an average premium of 0.22% last week, holding steady month-over-month."
    },
    {
      "line_title": "Long-Haul Premium Uptick",
      "line_content": "Long-haul routes saw GDS premium incidence jump to 7.34% last week (up 1.88pt week-over-week) with a +0.11% average price difference."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "Channel Missing (GDS N/A)",
      "line_content": "GDS N/A status represented 95.84% of itineraries last week, increasing by 0.53pt week-over-week and 0.46pt month-over-month."
    },
    {
      "line_title": "Price Parity (SAME)",
      "line_content": "Parity on GDS was negligible at 0.24% last week, marginally down by 0.04pt week-over-week and flat month-over-month, with an average price gap of +0.01%."
    },
    {
      "line_title": "GDS Premium (Higher)",
      "line_content": "3.88% of itineraries priced higher on GDS last week, down 0.50pt from the prior week and 0.46pt from last month, carrying a +0.22% average markup."
    },
    {
      "line_title": "Channel Discount (Lower)",
      "line_content": "GDS lower pricing was virtually non-existent at 0.04% last week, unchanged week-over-week and month-over-month, with an average discount of -0.08%."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short-Haul",
      "line_content": "Coverage gaps persist with 96.23% GDS N/A (up 0.56pt), while 3.73% of short-haul listings were priced 0.23% higher on average (down 0.60pt)."
    },
    {
      "line_title": "Long-Haul",
      "line_content": "87.16% of long-haul itineraries were not found on GDS, flat month-over-month, while 7.34% carried a 0.11% price premium, rising 1.88pt week-over-week."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "Domestic (BR)",
      "line_content": "GDS channel shows 100% N/A for all 29 domestic ODs, indicating complete content absence on GDS for Brazil origins."
    },
    {
      "line_title": "International (Non-BR)",
      "line_content": "92.38% of non-BR routes were priced higher on GDS last week with a +0.22% markup (down 0.84pt), while 5.71% achieved parity."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In",
      "line_content": "Close-in bookings have 96.24% N/A coverage (up 0.68pt) and 3.45% priced higher on GDS at +0.26% average premium (down 0.63pt)."
    },
    {
      "line_title": "Far-Out",
      "line_content": "Far-out bookings saw 95.19% N/A and a higher incidence of premiums at 4.69% (down 0.26pt), with a 0.18% average markup last week."
    }
  ]
}