{
  "key_channel_insights": [
    {
      "line_title": "OTA Price Divergence",
      "line_content": "OTA fares exceed the website on 17.5% of routes (up from 14.9% last week) while undercutting it on 7.2%, indicating growing dispersion across channels."
    },
    {
      "line_title": "MSE Discount Dominance",
      "line_content": "MSE offers are cheaper on 72.84% of itineraries (despite a 4.11pp month-over-month decline), with price parity rising to 22.84% and minimal overpricing risk."
    },
    {
      "line_title": "GDS Consistent Premium",
      "line_content": "GDS fares are higher on 92.8% of routes (up 1.06pp week-over-week), carrying an average markup of +0.66% and full coverage of far-out bookings."
    }
  ],
  "conclusion": [
    {
      "line_title": "",
      "line_content": "This report provides a high-level summary of the price discrepancies observed across different channels.  It is important to note that the data contains many nuances depending on various factors such as market conditions, booking windows, and the competitive landscape. Understanding these subtleties can be critical in optimizing pricing strategies and ensuring competitive positioning."
    },
    {
      "line_title": "",
      "line_content": "As part of our 'PriceEye' solution, we are developing an intuitive dashboard designed to help your airline's analysts drill down into this data. This tool will allow you to uncover and focus on critical actionable insights, enabling your team to make data-driven decisions with confidence."
    },
    {
      "line_title": "",
      "line_content": "We are here to support you in leveraging these insights to enhance your revenue management and distribution strategies. Please don't hesitate to connect with our team for more information about how PriceEye can assist you in achieving your business objectives."
    }
  ],
  "ota_highlights": [
    {
      "line_title": "Rising OTA Premiums",
      "line_content": "OTA fares exceed the website on 17.5% of routes, up from 14.9% last week and 11.9% last month, with an average markup of 0.07%."
    },
    {
      "line_title": "Growing OTA Discounts",
      "line_content": "The channel undercuts the website on 7.2% of routes, increasing from 5.7% week-over-week and 2.4% month-over-month, offering an average discount of 0.04%."
    },
    {
      "line_title": "Stable Price Parity",
      "line_content": "Price parity persists on 62.6% of routes, though this share has dipped 1.9% from last week and 10.0% from last month, reflecting modest channel–site divergence."
    }
  ],
  "ota_summary_high_level_comparison": [
    {
      "line_title": "OTA N/A Availability",
      "line_content": "Routes with no OTA offer stand at 12.7%, down 2.2% week-over-week and 0.4% month-over-month, indicating improved channel coverage."
    },
    {
      "line_title": "Price Parity Share",
      "line_content": "Parity occurs on 62.6% of routes, edging down 1.9% versus last week and nearly 10.0% versus last month, signaling slight channel–site misalignment."
    },
    {
      "line_title": "Higher OTA Fares",
      "line_content": "OTA fares are higher on 17.5% of routes, rising 2.6% week-over-week and 5.6% month-over-month, with a steady 0.06%–0.07% premium."
    },
    {
      "line_title": "Lower OTA Fares",
      "line_content": "OTA fares are lower on 7.2% of routes, up 1.5% week-over-week and 4.8% month-over-month, with average discounts deepening to 0.06%."
    }
  ],
  "ota_summary_by_region": [
    {
      "line_title": "Short Haul Trends",
      "line_content": "Short-haul routes show 64.9% parity (down 2.2% week-over-week), while OTA higher and lower frequencies modestly increase to 13.9% and 7.9%, respectively."
    },
    {
      "line_title": "Long Haul Dynamics",
      "line_content": "Long-haul routes split evenly between parity and OTA higher (44.9% each), with minimal markup (0.02%) and negligible discount activity."
    }
  ],
  "ota_summary_by_point_of_origin": [
    {
      "line_title": "Singapore Origins",
      "line_content": "SG markets deliver 78.2% parity, with OTA higher at 8.7% and lower at 6.8%, both shares up week-over-week amid stable price gaps."
    },
    {
      "line_title": "Non-SG Origins",
      "line_content": "Non-SG markets record 47.6% parity (down 3.3% week-over-week), while 25.7% of routes show OTA higher fares, up 2.8% week-over-week."
    }
  ],
  "ota_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "Close-in itineraries feature 59.3% parity, with OTA higher on 16.8% (+1.8% week-over-week) and lower on 7.9% (+2.3%)."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Far-out bookings hold 68.8% parity (down 5.6% week-over-week), while OTA higher share jumps to 18.8% (+4.2%)."
    }
  ],
  "mse_highlights": [
    {
      "line_title": "Major Discount Prevalence",
      "line_content": "On MSE, 72.84% of Scoot itineraries are priced lower than on the airline site, delivering an average 0.05% discount, although this share has dipped 4.11 percentage points compared to last month."
    },
    {
      "line_title": "Growing Price Parity",
      "line_content": "Price parity is strengthening, with 22.84% of offers matching the website price in the latest week, up by 4.63 percentage points from a month ago."
    },
    {
      "line_title": "Negligible MSE Premium",
      "line_content": "Instances of MSE prices exceeding the website are virtually zero at 0.24% last week and dropped to 0% month-to-date, indicating minimal risk of overpricing."
    }
  ],
  "mse_summary_high_level_comparison": [
    {
      "line_title": "MSE N/A Availability",
      "line_content": "4.09% of itineraries were not found on MSE in the latest week, a 1.59pp decrease from the prior week and down 0.77pp month-over-month."
    },
    {
      "line_title": "Price Matches",
      "line_content": "22.84% of offers matched the website price last week, increasing by 3.92pp from the previous week and 4.63pp versus last month."
    },
    {
      "line_title": "MSE Higher",
      "line_content": "Only 0.24% of listings were priced higher on MSE last week, unchanged week-over-week and down from 0.24% the previous month, with an average 0.14% premium."
    },
    {
      "line_title": "MSE Lower",
      "line_content": "72.84% of offers were cheaper on MSE in the latest week, down 2.34pp from the prior week and 4.11pp month-over-month, averaging a 0.05% discount."
    }
  ],
  "mse_summary_by_region": [
    {
      "line_title": "Short Haul Pricing",
      "line_content": "Short-haul routes show 73.10% of fares lower on MSE last week (0.05% average discount), with price parity rising to 22.28% and unavailable offers falling to 4.35%."
    },
    {
      "line_title": "Long Haul Pricing",
      "line_content": "Long-haul itineraries achieved 68.75% lower prices on MSE last week, down 3.25pp week-over-week, with matched pricing at 27.08%—the highest parity among segments—and no instances of higher pricing."
    }
  ],
  "mse_summary_by_point_of_origin": [
    {
      "line_title": "SG Origins",
      "line_content": "Singapore-origin itineraries saw 84.95% priced lower on MSE last week (0.04% average discount), matched pricing at 11.17%, and unavailable listings at 3.40%."
    },
    {
      "line_title": "Non-SG Origins",
      "line_content": "Non-SG origins had 60.66% lower-priced offers on MSE last week with a 0.06% average discount, while price matches improved by 7.02pp to 34.12%."
    }
  ],
  "mse_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "Close-in bookings delivered 69.64% lower fares on MSE last week (0.06% discount), matched pricing increased by 4.36pp to 24.29%, and higher fares were non-existent."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "Far-out bookings experienced the highest incidence of discounts on MSE at 78.83% last week (0.04% average discount), with matches at 20.44% and a small 0.73% share of higher prices."
    }
  ],
  "gds_highlights": [
    {
      "line_title": "Predominant GDS Markup",
      "line_content": "92.8% of routes on GDS were priced higher than Scoot’s site last week, a 1.06pp increase from the prior week, with an average markup of +0.66%."
    },
    {
      "line_title": "Improving Listing Completeness",
      "line_content": "GDS ‘not found’ occurrences fell to 6.95% of itineraries in the latest week, down 1.06pp from the previous week and 1.54pp month-over-month."
    },
    {
      "line_title": "Far-Out Premium",
      "line_content": "All far-out bookings on GDS were costlier than the website last week, with an average premium of +0.81%, outperforming close-in markups of +0.58%."
    }
  ],
  "gds_summary_high_level_comparison": [
    {
      "line_title": "GDS N/A Frequency",
      "line_content": "6.95% of ODs lacked a GDS offer last week, improving from 8.02% the prior week and 8.50% month-ago."
    },
    {
      "line_title": "Price Parity",
      "line_content": "No itineraries matched website fares on GDS last week, consistent with prior periods."
    },
    {
      "line_title": "GDS Lower",
      "line_content": "Only 0.24% of routes showed lower GDS fares last week, unchanged week-over-week, with an average discount of -0.41%."
    },
    {
      "line_title": "GDS Higher",
      "line_content": "92.81% of routes had higher GDS fares last week, up 1.06pp week-over-week, carrying an average premium of +0.66%."
    }
  ],
  "gds_summary_by_region": [
    {
      "line_title": "Short Haul",
      "line_content": "92.41% of short-haul routes were pricier on GDS last week, up 0.95pp from the prior week, with an average markup of +0.69%."
    },
    {
      "line_title": "Long Haul",
      "line_content": "95.83% of long-haul routes carried higher GDS fares last week, rising 1.96pp week-over-week, at an average premium of +0.45%."
    }
  ],
  "gds_summary_by_point_of_origin": [
    {
      "line_title": "SG Origin",
      "line_content": "93.20% of SG-origin routes were priced higher on GDS last week, advancing 0.82pp week-over-week, with an average increase of +0.52%."
    },
    {
      "line_title": "Non-SG Origin",
      "line_content": "92.42% of Non-SG-origin routes showed higher GDS fares last week, up 1.30pp from the prior week, with an average premium of +0.79%."
    }
  ],
  "gds_summary_by_booking_window": [
    {
      "line_title": "Close-In Bookings",
      "line_content": "89.29% of close-in itineraries had higher GDS prices last week, up 1.17pp week-over-week, with an average markup of +0.58%."
    },
    {
      "line_title": "Far-Out Bookings",
      "line_content": "100% of far-out itineraries were costlier on GDS last week, up 0.72pp from the prior week, carrying the largest average premium of +0.81%."
    }
  ]
}